{
  "users": [
    {
      "email": "mymail@gmail.com",
      "password": "$2a$10$RoEvz4ThRRV0MsC/HA184ehUnsTXysUdl1Gx.PD3I9XyCF9H6cQNO",
      "favourites": "",
      "owned": "",
      "id": 1
    },
    {
      "email": "23234@121412",
      "password": "$2a$10$p7pwKi37vm.2s7OULdy8K.DNWH5qVb8SgCbJjWg2EMW7g9dgg8M4.",
      "favourites": "",
      "owned": "",
      "id": 2
    },
    {
      "email": "34143@1223",
      "password": "$2a$10$.bTXwaKcQtlBDUKz1OFjCejLG5.YCojYYm6uPKYtGxKY9gb3RrHw.",
      "favourites": "",
      "owned": "",
      "id": 3
    }
  ],
  "test": [
    {
      "action": "2",
      "id": 1
    },
    {
      "action": "1",
      "id": 2
    }
  ],
  "games": [
    {
      "id": 1,
      "name": "The Sims 3",
      "image": "https://upload.wikimedia.org/wikipedia/ru/thumb/7/7d/The_Sims_3_logo.JPG/548px-The_Sims_3_logo.JPG",
      "description": "The Sims 3 — однопользовательская видеоигра в жанре симулятора жизни, разработанная компанией Maxis под руководством геймдизайнера Рода Хамбла и изданная компанией Electronic Arts. В США игра вышла 2 июня 2009 года для операционных систем персональных компьютеров — Windows и Mac OS X[3]. На территории России The Sims 3 вышла 5 июня 2009 года, её русской локализацией занималась компания «СофтКлаб»[8]. Помимо этого, в 2010 году состоялся выпуск симулятора для игровых приставок PlayStation 3, Xbox 360, Wii и Nintendo DS",
      "year": 2008,
      "ganre": "симулятор жизни",
      "platforms": "Windows, MacOS",
      "developerId": 1,
      "publisherId": 2,
      "iHave": false,
      "iWant": false,
      "rating": 3,
      "notes": "любимая игра сестрички",
      "rawgId": null
    },
    {
      "id": 2,
      "name": "Populous: The Beginning",
      "image": "https://upload.wikimedia.org/wikipedia/ru/c/c5/Populous.jpeg",
      "description": "Populous: The Beginning — компьютерная игра в жанре стратегии в реальном времени и симулятора бога, третья в серии Populous. Игра была разработана студией Bullfrog и выпущена Electronic Arts для Windows в 1998 году. В 1999 году вышла версия для консоли PlayStation. В отличие от предыдущих игр серии, в которых игрок принимал на себя роль бестелесного божества, в Populous: The Beginning под его управлением находится персонаж-шаман, возглавляющий племя первобытных людей. В ходе основной кампании племя перемещается с одной планеты на другую, подчиняя себе другие племена и разыскивая новые источники магии; конечная цель для шамана — стать полноценным божеством.",
      "year": 1998,
      "ganre": "стратегия в реальном времени",
      "platforms": "Windows, PS",
      "developerId": 3,
      "publisherId": 2,
      "iHave": false,
      "iWant": true,
      "rating": 5,
      "notes": "братик играл в детсте. крутая!",
      "rawgId": null
    },
    {
      "name": "Space Mafness",
      "image": "https://media.rawg.io/media/screenshots/884/88428c52f49af3961dc3d07e859fc81b.jpg",
      "description": "Very old game",
      "year": "2016-10-25",
      "genre": "Action",
      "platforms": "PC",
      "developerId": 1,
      "publisherId": 2,
      "rating": "0",
      "rawgId": "144518",
      "id": 10
    },
    {
      "name": "Demon's Souls",
      "image": "https://media.rawg.io/media/games/ac3/ac3a89bfbda76082402e42b933c5825a.jpg",
      "description": "Demon's Souls is an action role-playing game developed by FromSoftware for the PlayStation 3 under the supervision of Japan Studio. It was published in Japan by Sony Computer Entertainment in February 2009, in North America by Atlus USA in October 2009, and in PAL territories by Namco Bandai Games in June 2010. The game is referred to as a spiritual successor to FromSoftware's King's Field series. The first installment of the Souls series, Demon's Souls is set in Boletaria, a kingdom consumed by a dark being called the Old One, following its release through the use of forbidden Soul Arts. Players take on the role of a hero brought to Boletaria to kill its fallen king Allant and pacify the Old One. Gameplay has players navigating five different worlds from a hub called the Nexus, with a heavy emphasis on challenging combat and mechanics surrounding player death and respawning. Online multiplayer allows both player cooperation and world invasions featuring player versus player combat. The game's early development was troubled due to a lack of coherent vision. Despite such issues, FromSoftware staff member Hidetaka Miyazaki was able to take over the project and helped to turn the title into what it eventually became. The game's difficulty was intended to both evoke classic video games and provide a sense of challenge and accomplishment for players. This aspect proved demanding for Miyazaki, partly because of his fear that Sony would ask the team to lower the difficulty in order to make the game more accessible. The multiplayer elements were inspired by events in Miyazaki's life. Announced in 2008, early reactions to Demon's Souls demo were seen as negative, and the game's high difficulty prompted Sony to pass on publishing the title outside of Japan. While the game met with middling reception and sales in Japan, it became a commercial and critical success in the West. The game was praised for its difficult combat and addictive gameplay, subsequently winning several awards. Its success began a series of Souls games starting with Dark Souls in 2011. A remake by Bluepoint Games and Japan Studio, was released as a launch title for the PlayStation 5 in November 2020.",
      "year": "2009-02-05",
      "genre": "Action, RPG",
      "platforms": "PlayStation 3",
      "developerId": 0,
      "publisherId": 0,
      "rating": "4.27",
      "rawgId": "4108",
      "id": 11
    },
    {
      "name": "The Sims 4",
      "image": "https://media.rawg.io/media/games/e44/e445335e611b4ccf03af71fffcbd30a4.jpg",
      "description": "The Sims 4 is a 2014 life simulation video game developed by the Redwood Shores studio of Maxis and published by Electronic Arts. It is the fourth major title in The Sims series and was originally announced on May 6, 2013. It was released in North America on September 2, 2014, for Microsoft Windows. A Mac-compatible version of the game was released on February 17, 2015. The Sims 4 is the first PC game to top all-format charts in two years. The game has received mixed reviews since its release, with the majority of criticism directed towards its lack of content. Ten expansion packs have been released. The most recent is Snowy Escape, which was released on November 13, 2020. There have also been eighteen \"stuff packs\" and nine \"game packs\" released for this generation, as well as free updates that include major changes such as the addition of a toddler life stage.",
      "year": "2014-09-02",
      "genre": "Casual, Strategy, Simulation",
      "platforms": "PC, Xbox One, PlayStation 4, macOS",
      "developerId": 1,
      "publisherId": 2,
      "rating": "3.69",
      "rawgId": "42187",
      "id": 12
    },
    {
      "name": "The Sims 2",
      "image": "https://media.rawg.io/media/games/d26/d263d8d035027185193ddd253a6e3479.jpg",
      "description": "The Sims 2 is a 2004 strategic life simulation video game developed in Redwood City, California studio of Maxis and published by Electronic Arts. It is the sequel to The Sims.  The game allows you to create your own Sim, neighborhoods, houses, and families. Players manage their Sims so they can experience rewards and form relationships in a manner similar to real life. The Sims 2, like its predecessor, does not have a defined final goal; the gameplay is open-ended. Sims have life goals, wants and fears, the fulfillment of which can produce both positive or negative outcomes. All Sims age, and can live to 90 sim days depending on the degree to which their aspirations are fulfilled. The Sims 2 builds on its predecessor by allowing Sims to age through six stages of life and incorporating a 3D graphics engine that allows the player to get 360º views of the game as opposed to the fixed isometric view of The Sims. Although gameplay is not linear, storylines exist in the game's pre-built neighborhoods. Pleasantview is based 25 years after the town in the original The Sims. Strangetown's storyline is based on the supernatural, and is loosely connected with Pleasantview. Veronaville's characters are based on Shakespearean characters.  The Sims 2 was released on September 14, 2004 for Microsoft Windows. A port to macOS was released on June 17, 2005. Eight expansion packs and nine stuff packs were subsequently released. In addition several console versions have been released. The Sims 2 is offered on mobile platforms, with manufacturers such as Nokia offering The Sims 2 from the Ovi Store. A sequel, The Sims 3, was released in June 2009.  The Sims 2 was a commercial success, selling one million copies in its first ten days, a record at the time. During April 2008, The Sims 2 website announced that 100 million copies of The Sims series had been sold. The Sims 2 was well received by critics, gaining a 90% score from aggregators Metacritic and GameRankings. By March 2012, the game had sold 13 million copies over all platforms with over six million PC copies, making it one of the best-selling PC games of all-time.",
      "year": "2004-09-14",
      "genre": "Simulation",
      "platforms": "PC, Nintendo DS, Xbox, PlayStation 2, Game Boy Advance, Classic Macintosh",
      "developerId": 1,
      "publisherId": 2,
      "rating": "4.25",
      "rawgId": "24940",
      "id": 13
    },
    {
      "name": "The Sims 3 Pets",
      "image": "https://media.rawg.io/media/games/483/4839f3efb4b9e237deb0341252630927.jpg",
      "description": "The Sims 3: Pets is the fifth expansion pack for The Sims 3 on PC and Mac, and is the second console game in the series. It was released on October 18, 2011 in North America. Like in previous expansions for The Sims games, this expansion introduces pets such as cats and dogs and, for the first time, horses into the game, however only the PC expansion pack has horses.",
      "year": "2011-10-18",
      "genre": "Strategy, Simulation",
      "platforms": "PC, Nintendo 3DS, Xbox 360, PlayStation 3",
      "developerId": 1,
      "publisherId": 2,
      "rating": "3.84",
      "rawgId": "5690",
      "id": 14
    },
    {
      "name": "ARK: Survival Evolved",
      "image": "https://media.rawg.io/media/games/58a/58ac7f6569259dcc0b60b921869b19fc.jpg",
      "description": "Ark: Survival Evolved (stylized as ΛRK) is a 2017 action-adventure survival video game developed by Studio Wildcard, in collaboration with Instinct Games, Efecto Studios, and Virtual Basement. In the game, players must survive being stranded on an island filled with roaming dinosaurs and other prehistoric animals, natural hazards, and potentially hostile human players.  The game is played from either a third-person or first-person perspective and its open world is navigated on foot or by riding a prehistoric animal. Players can use firearms and improvised weapons to defend against hostile humans and creatures, with the ability to build bases as defense on the ground and on some creatures. The game has both single-player and multiplayer options. Multiplayer allows the option to form tribes of members in a server. The max number of tribe mates varies from each server. In this mode all tamed dinosaurs and building structures are usually shared between the members. There is a PvE mode where players cannot fight each other.  Development began in October 2014, where it was first released on PC as an early access title in the middle of 2015. The development team conducted research into the physical appearance of the animals, but took creative license for gameplay purposes. Egypt-based developer Instinct Games was hired to facilitate the game's development. The game was released in August 2017 for PlayStation 4, Xbox One, Microsoft Windows, OS X and Linux, with versions for Android, iOS, and Nintendo Switch in 2018; a version for Stadia is scheduled for release in early 2021. It received generally mixed reviews, with criticism for its \"punishing\" difficulty, reliance on grinding, and performance issues, particularly on the Nintendo Switch version. Several expansions to the game have been released as downloadable content. The game begot two spin-off games in March 2018—virtual reality game Ark Park and sandbox survival game PixArk—and two companion apps: A-Calc in October 2015, and Dododex in August 2017.",
      "year": "2015-06-02",
      "genre": "Adventure, Action, RPG, Indie, Massively Multiplayer",
      "platforms": "PC, Xbox One, PlayStation 4, Nintendo Switch, iOS, macOS, Linux",
      "developerId": 8,
      "publisherId": 8,
      "rating": "3.13",
      "rawgId": "9810",
      "id": 15
    },
    {
      "name": "Counter-Strike",
      "image": "https://media.rawg.io/media/games/9c4/9c47f320eb73c9a02d462e12f6206b26.jpg",
      "description": "Counter-Strike (also known as Half-Life: Counter-Strike or Counter-Strike 1.6) is a first-person shooter video game developed by Valve. It was initially developed and released as a Half-Life modification by Minh \"Gooseman\" Le and Jess Cliffe in 1999, before Le and Cliffe were hired and the game's intellectual property acquired. Counter-Strike was released by Valve for Microsoft Windows in 2000. The game is the first installment in the Counter-Strike series. Several remakes and ports have been released on Xbox, as well as OS X and Linux.",
      "year": "2000-11-01",
      "genre": "Shooter, Action",
      "platforms": "PC, macOS, Linux, Xbox",
      "developerId": 4,
      "publisherId": 4,
      "rating": "4.04",
      "rawgId": "19301",
      "id": 16
    }
  ],
  "companies": [
    {
      "id": 1,
      "name": "Maxis",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/0/0e/Maxis_logo_new.svg/400px-Maxis_logo_new.svg.png",
      "description": "Maxis — американская компания по разработке компьютерных игр, принадлежащая Electronic Arts. Основана в 1987 году как Maxis Software, а затем стала известна как Maxis.",
      "year": 1987,
      "rating": 4,
      "notes": null,
      "isPublisher": false,
      "rawgId": null
    },
    {
      "id": 2,
      "name": "Electronic Arts",
      "image": "https://upload.wikimedia.org/wikipedia/commons/e/e5/Electronic_Arts_Logo_2020.png",
      "description": "Electronic Arts (или EA) — американская корпорация, занимающаяся распространением видеоигр. Штаб-квартира компании расположена в городе Редвуд-Сити, Калифорния.",
      "year": 1982,
      "rating": 3,
      "notes": "Они ещё футбольчики всякие делают",
      "isPublisher": true,
      "rawgId": null
    },
    {
      "id": 3,
      "name": "Bullfrog Productions",
      "image": "https://upload.wikimedia.org/wikipedia/ru/thumb/b/be/Bullfrog-logo.svg/235px-Bullfrog-logo.svg.png",
      "description": "Bullfrog Productions (bullfrog с англ. — «лягушка-бык») — британский разработчик компьютерных игр из Гилфорда, Англия. Компания основана в 1987 году Питером Молиньё и Лесом Эдгаром. Компания стала известна после выхода в 1989 году игры Populous, а получила признание после выхода таких широко известных игр как Theme Park, Magic Carpet, Syndicate и Dungeon Keeper. Название компания получила от орнамента, которым был украшен офис Taurus Impact Systems, другой компании Молиньё и Эдгара и предшественника Bullfrog, в которой они занимались разработкой программного обеспечения для бизнеса. Bullfrog Productions была основана как независимая компания после случая, когда в Commodore перепутали Taurus с другой компанией из-за схожести названия.",
      "year": 1987,
      "rating": 4,
      "notes": "Старенькая, но крутая!",
      "isPublisher": false,
      "rawgId": null
    },
    {
      "name": "Valve Corporation",
      "image": "https://upload.wikimedia.org/wikipedia/commons/6/6c/Valve-logo.jpg",
      "description": "Valve Corporation, also known as Valve Software, is an American video game developer, publisher, and digital distribution company headquartered in Bellevue, Washington. It is the developer of the software distribution platform Steam and the Half-Life, Counter-Strike, Portal, Day of Defeat, Team Fortress, Left 4 Dead, and Dota series.",
      "year": "1996",
      "rating": "5",
      "isPublisher": true,
      "id": 4
    },
    {
      "name": "Facepunch Studios",
      "image": "https://pbs.twimg.com/profile_images/1247149194093133825/N_9ul0cD_400x400.png",
      "description": "Facepunch Studios Ltd is a British independent developer and publisher of video games headquartered in Walsall, England founded in June 2004 and incorporated on 17 March 2009 by Garry Newman. The company is most known for its sandbox video game Garry's Mod and survival game Rust. They're currently developing a sequel to Garry's Mod titled S&box, set to enter early access at some point in 2021.",
      "year": "June 2004",
      "rating": "4.27",
      "isPublisher": true,
      "id": 7
    },
    {
      "name": "Studio Wildcard",
      "image": "https://upload.wikimedia.org/wikipedia/en/8/82/Studio_Wildcard_logo.png",
      "description": "Wildcard Properties, LLC (trade name: Studio Wildcard) is an American video game developer with offices in Kirkland, Washington, and Gainesville, Florida. The company was founded in October 2014 by Doug Kennedy, Jesse Rapczak, Jeremy Stieglitz, and Susan Browning Stieglitz. Stieglitz had previously left his position at Trendy Entertainment in August 2014 under a one-year non-compete agreement. The company sued him and Studio Wildcard in December 2015 for breach of contract, among other allegations, and the parties settled in April 2016. Studio Wildcard's debut game, Ark: Survival Evolved, was released in August 2017. A sequel, Ark II, was announced in December 2020.",
      "year": "October 2014",
      "rating": "3",
      "isPublisher": true,
      "id": 8
    },
    {
      "name": "Blizzard Entertainment",
      "image": "https://upload.wikimedia.org/wikipedia/commons/thumb/b/b2/Blizzard_Entertainment_Logo.svg/1200px-Blizzard_Entertainment_Logo.svg.png",
      "description": "Blizzard Entertainment, Inc. is an American video game developer and publisher based in Irvine, California. A subsidiary of Activision Blizzard, the company was founded on February 8, 1991, under the name Silicon & Synapse, Inc. by three graduates of the University of California, Los Angeles: Michael Morhaime, Frank Pearce and Allen Adham. The company originally concentrated on the creation of game ports for other studios' games before beginning development of their own software in 1993 with games like Rock n' Roll Racing and The Lost Vikings. In 1994, the company became Chaos Studios, Inc., and eventually Blizzard Entertainment after being acquired by distributor Davidson & Associates. Shortly thereafter, Blizzard released Warcraft: Orcs & Humans. Since then, Blizzard Entertainment has created several Warcraft sequels, including highly influential massively multiplayer online role-playing game World of Warcraft in 2004, as well as three other multi-million selling video game franchises: Diablo, StarCraft and Overwatch. Their most recent projects include the expansion for Diablo III, Reaper of Souls, the online collectible card game Hearthstone, the multiplayer online battle arena Heroes of the Storm, the third and final expansion for StarCraft II: Wings of Liberty, Legacy of the Void, the multiplayer first-person hero shooter Overwatch, and the eighth expansion for World of Warcraft, Shadowlands. The games are operated through online gaming service Battle.net. On July 9, 2008, Activision merged with Vivendi Games, culminating in the inclusion of the Blizzard brand name in the title of the resulting holding company. On July 25, 2013, Activision Blizzard announced the purchase of 429 million shares from majority owner Vivendi. As a result, Activision Blizzard became a completely independent company.  Blizzard Entertainment hosts annual gaming conventions for fans to meet and to promote their games: the first BlizzCon was held in October 2005, and since then, all of the conventions have been held at the Anaheim Convention Center in Anaheim, California. BlizzCon features game-related announcements, previews of upcoming Blizzard Entertainment games and content, Q&A sessions and panels, costume contests, and playable versions of various Blizzard games. Blizzard WorldWide Invitationals were events similar to BlizzCon held in South Korea and France between 2004 and 2008.",
      "year": "February 1991",
      "rating": "3",
      "isPublisher": true,
      "id": 9
    },
    {
      "name": "Ubisoft",
      "image": "https://www.legendstore.ru/upload/iblock/710/71006cee702047f76a81d27bb0cb64c2.png",
      "description": "Ubisoft Entertainment SA(formerly Ubi Soft Entertainment SA) is a French video game company headquartered in the Montreuil suburb of Paris with several development studios across the world. Its video game franchises include Rayman, Raving Rabbids, Prince of Persia, Assassin's Creed, Far Cry, Watch Dogs, Just Dance, and the Tom Clancy's series. According to Guillemot, Ubisoft recognised that connected sandbox games, with seamless switches between single and multiplayer modes provided the players with more fun, leading the company to switch from pursuing single-player only games to internet connected ones. According to Guillemot, Ubisoft internally refers to its reimagined self as 'before The Division' and an 'after The Division'.  In an interview with The Verge, Anne Blondel-Jouin, executive producer of The Crew turned vice-president of live operations, noted that The Crew was an early game of Ubisoft's to require a persistent internet connection in order to play. This raised initial concerns for gamers, hampering the game's initial success and sparked concerns internally at the company. ",
      "year": "28 March 1986",
      "rating": "4",
      "isPublisher": true,
      "id": 10
    },
    {
      "name": "Paradox Interactive",
      "image": "https://res-3.cloudinary.com/crunchbase-production/image/upload/c_lpad,h_256,w_256,f_auto,q_auto:eco/v1421583826/dlbcnxatnjyjf2gacyxg.png",
      "description": "Paradox Interactive AB is a video game publisher based in Stockholm, Sweden. The company started out as the video game division of Target Games and then Paradox Entertainment (now Cabinet Entertainment) before being spun out into an independent company in 2004. Through a combination of founding new studios and purchasing independent developers, the company has grown to comprise nine first-party development studios, including their flagship Paradox Development Studio, and acts as publisher for games from other developers.  Paradox is best known for releasing historically themed strategy video games, especially grand strategy games, and has published strategy games in different settings, as well as games of other genres such as role-playing video game and management simulators. They typically continue development of their games after initial release with the creation of downloadable content, and are also known for creating games that are easy to mod.  Outside of video games, Paradox has created board games based on several of its titles, and have owned the rights to the tabletop role-playing game series World of Darkness since purchasing White Wolf Publishing in 2015. They hold an annual convention, PDXCon, which has been open to the public since 2017.",
      "year": "1999",
      "rating": "5",
      "isPublisher": true,
      "id": 11
    }
  ]
}